protected/controllers/input.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><q1:getUser xmlns:q1="IntaRA"><user xsi:type="xsd:string">䦶</user></q1:getUser></s:Body></s:Envelope>